src/DataProcessors/СозданиеМТКПоОчередиСчетовЗаказов/СозданиеМТКПоОчередиСчетовЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеМТКПоОчередиСчетовЗаказов</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/AccumulationRegisters/ЗаказыНаПроизводство/ЗаказыНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыНаПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ПаспортЛинейки/ПаспортЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортЛинейки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВремяТактаМаксимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаМинимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаРасчётное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыпускЗаДеньРасчётный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ТехническийЛидер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЛьготнаяОчередь/ЛьготнаяОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготнаяОчередь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/МаршрутнаяКарта/МаршрутнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутнаяКарта</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.РемонтнаяКарта</basedOn>
  <basedOn>Document.СписаниеМПЗПрочее</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИнициатор</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредполагаемогоОкончанияОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОстановки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗОстановки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.СтандартныеКомментарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остановки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредполагаемая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/СозданиеМТКПоОчередиСчетовЗаказов/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьКоличествоЗапусков(Продукция,СчётЗаказ)	
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетаЗаказыОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК СчетаЗаказыОбороты
	|ГДЕ
	|	СчетаЗаказыОбороты.КоличествоРасход > 0
	|	И СчетаЗаказыОбороты.Продукция = &Продукция
	|	И СчетаЗаказыОбороты.Документ = &Документ";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
Запрос.УстановитьПараметр("Продукция", Продукция);
Запрос.УстановитьПараметр("Документ", СчётЗаказ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Возврат(ВыборкаДетальныеЗаписи.Количество());
КонецФункции

&НаСервере
Процедура ЛинейкаПриИзмененииНаСервере()
ТаблицаСчетовЗаказов.Очистить();
ПаспортЛинейки = РегистрыСведений.ПаспортЛинейки.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Линейка",Объект.Линейка));
ВыпускЗаДеньРасчётный = ПаспортЛинейки.ВыпускЗаДеньРасчётный; 
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыНаПроизводство.Документ,
	|	ЗаказыНаПроизводство.Продукция,
	|	ЗаказыНаПроизводство.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки КАК ЗаказыНаПроизводство
	|ГДЕ
	|	ЗаказыНаПроизводство.Продукция.Линейка = &Линейка";
Запрос.УстановитьПараметр("Линейка", Объект.Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоОстаток > 0 Тогда
		ТЧ = ТаблицаСчетовЗаказов.Добавить();
		ТЧ.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.Документ;
		ТЧ.Продукция = ВыборкаДетальныеЗаписи.Продукция;
		ТЧ.Товар = ВыборкаДетальныеЗаписи.Продукция.Товар;
		ТЧ.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		ТЧ.КоличествоЗапусков = ПолучитьКоличествоЗапусков(ВыборкаДетальныеЗаписи.Продукция,ВыборкаДетальныеЗаписи.Документ);
		ТЧ.ЛьготнаяОчередь = Не ПроверитьНаЛО(ТЧ.Продукция);
		КонецЕсли; 
	КонецЦикла;
ТаблицаСчетовЗаказов.Сортировать("КоличествоЗапусков,ЗаказНаПроизводство,Продукция");
ТаблицаМТК.Очистить();
Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	//|	МаршрутнаяКарта.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	МаршрутнаяКарта.Линейка = &Линейка
	|	И МаршрутнаяКарта.Статус <> 3
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутнаяКарта.НомерОчереди";
//Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
//Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
Запрос.УстановитьПараметр("Линейка", Объект.Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаМТК.Добавить();
	ТЧ.МТК = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЛинейкаПриИзменении(Элемент)
ЛинейкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПроверитьНаЛО(Продукция)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.ПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.Линейка = &Линейка
	|	И ЛьготнаяОчередь.Изделие = &Изделие
	|	И ЛьготнаяОчередь.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
Запрос.УстановитьПараметр("Линейка",Объект.Линейка);
Запрос.УстановитьПараметр("Изделие",Продукция);
РезультатЗапроса = Запрос.Выполнить();
Возврат(Не РезультатЗапроса.Пустой());
КонецФункции

&НаСервере
Функция СоздатьМТКНаСервере()
	Для каждого ТЧ Из ТаблицаСчетовЗаказов Цикл
		Если ТЧ.Количество <= ТЧ.Продукция.Товар.КрупностьЗаказа Тогда
		Количество = ТЧ.Количество;
		Иначе		
		Количество = ТЧ.Продукция.Товар.КрупностьЗаказа;
		КонецЕсли;
	ТЧ.ЛьготнаяОчередь = ПроверитьНаЛО(ТЧ.Продукция);
			Если Не ТЧ.ЛьготнаяОчередь Тогда
			МТК = ОбщийМодульСозданиеДокументов.СоздатьМТК(Объект.Линейка,ТЧ.Продукция,Количество,Справочники.СтандартныеКомментарии.ПустаяСсылка(),Справочники.Проекты.ПустаяСсылка(),Ложь,Истина,"",,,ТЧ.ЗаказНаПроизводство,ТЧ.ЗаказНаПроизводство.Контрагент.ОсобаяОтметка);
			Возврат(МТК);
			Иначе
			Продолжить;
			КонецЕсли;
	КонецЦикла;
Возврат(Документы.МаршрутнаяКарта.ПустаяСсылка());
КонецФункции

&НаКлиенте
Процедура СоздатьМТК(Команда)
МТК = СоздатьМТКНаСервере();
	Если Не МТК.Пустая() Тогда
	ЛинейкаПриИзмененииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Линейка") Тогда
	Объект.Линейка = Параметры.Линейка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Объект.Линейка.Пустая() Тогда
	ПоказатьОповещениеПользователя("Обработка...",,"Обработка очереди счёт-заказов...",БиблиотекаКартинок.Пользователь);
	ЛинейкаПриИзмененииНаСервере();
	МТК = СоздатьМТКНаСервере();
		Если Не МТК.Пустая() Тогда
		ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Создана МТК по счёт-заказу!",БиблиотекаКартинок.Пользователь);
		ЭтаФорма.Закрыть(Истина);
		Иначе
		ЭтаФорма.Закрыть(Ложь);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
ЛинейкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьМТКНаСервере(Стр)
ТЧ = ТаблицаМТК.НайтиПоИдентификатору(Стр);
МТКОбъект = ТЧ.МТК.ПолучитьОбъект();
МТКОбъект.Удалить();
ТаблицаМТК.Удалить(ТЧ);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМТК(Команда)
УдалитьМТКНаСервере(Элементы.ТаблицаМТК.ТекущаяСтрока);
КонецПроцедуры
